       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. colboltut.
       AUTHOR. Francois Xavier.
       DATE-WRITTEN.2 AOUT 2020

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

       01 SAMPLEDATA PIC X(10) VALUE "Stuff".
       01 JUSTLETTERS PIC AAA VALUE "ABC".
       01 JUSTNUMS PIC 9(4) VALUE 1234.
       01 SIGNEDINT PIC S9(4) VALUE -1234.
       01 PAYCHECK PIC 9(4)99 VALUE ZEROS.
       01 CUSTOMER.
           02 IDENT PIC 9(3).
           02 CUSTNAME PIC X(20).
           02 DATEOFBIRTH.
               03 MOB PIC 99.
               03 DOB PIC 99.
               03 YOB PIC 9(4).
       01 NUM1 PIC 9 VALUE 5.
       01 NUM2 PIC 9 VALUE 4.
       01 NUM3 PIC 9 VALUE 3.
       01 ANS PIC S99V99 VALUE 0.
       01 Rem PIC 9v99.

       
       PROCEDURE DIVISION.

       MOVE "More stuff" TO SAMPLEDATA
       MOVE "123" TO SAMPLEDATA
       MOVE 123 TO SAMPLEDATA
       DISPLAY SAMPLEDATA
       DISPLAY PAYCHECK
       MOVE "123Bob Smith           12211974" TO CUSTOMER
       DISPLAY CUSTOMER
       DISPLAY MOB "/" DOB "/" YOB
       MOVE ZERO TO SAMPLEDATA
       DISPLAY SAMPLEDATA
       MOVE SPACE TO SAMPLEDATA
       MOVE HIGH-VALUE TO SAMPLEDATA
       DISPLAY SAMPLEDATA


       ADD NUM1 TO NUM2 GIVING ANS
       DISPLAY ANS
       SUBTRACT NUM1 FROM NUM2 GIVING ANS
       DISPLAY ANS
       MULTIPLY NUM1 BY NUM2 GIVING ANS
       DISPLAY ANS
       DIVIDE NUM1 INTO NUM2 GIVING ANS
       DISPLAY ANS
       DIVIDE NUM1 INTO NUM2 GIVING ANS REMAINDER Rem
       DISPLAY "Remainder " Rem




       STOP RUN.
       